rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]
---
  def similar
    @id = params[:movie_id]
    @movie = Movie.find(@id)